export const classNamelist = {
  1: "প্লে",
  2: "নার্সারি",
  3: "প্রথম",
  4: "দ্বিতীয়",
  5: "তৃতীয়",
  6: "চতুর্থ",
  7: "পঞ্চম",
  8: "ষষ্ঠ",
  9: "সপ্তম",
  10: "অষ্টম",
  11: "নবম",
  12: "দশম",
  13: "একাদশ",
  14: "দ্বাদশ",
}

  export const examInstructions = [
    "প্রতিদিনের সকালের পরীক্ষা ৯টা এবং বিকালের পরীক্ষার ২টা থেকে শুরু হবে।",
    "পরীক্ষা শুরু হওয়ার ৩০ মিনিট পূর্বে নিজ নিজ আসন গ্রহণ করতে হবে।",
    "প্রত্যেক পরীক্ষায় প্রবেশপত্র সাথে আনতে হবে।",
    "পরীক্ষায় হলে কলম, পেন্সিল, রাবার, ক্যালকুলেটর, প্রবেশপত্র ও শিক্ষা উপকরণ ছাড়া অন্য কিছু রাখা যাবে না।",
    "উত্তরপত্রে প্রথমে নাম, রোল, শ্রেণী ভালোভাবে লিখতে হবে।",
    "পরীক্ষায় অসদুপায় অবলম্বন করলে পরীক্ষার্থী বহিষ্কার হতে পারে।",
  ];