export const secondTermExamRoutine = {
  1: [
    { date: "১৩-১২-২০২৫", week: "শনিবার", subject: "গণিত" },
    { date: "১৪-১২-২০২৫", week: "রবিবার", subject: "ইংরেজি" },
    { date: "১৫-১২-২০২৫", week: "সোমবার", subject: "বাংলা" },
    { date: "১৭-১২-২০২৫", week: "বুধবার", subject: "আরবি লিখা" },
    { date: "১৮-১২-২০২৫", week: "বৃহস্পতিবার", subject: "কালিমা ও মাসায়িল" },
    {
      date: "২০-১২-২০২৫",
      week: "শনিবার",
      subject: "হাদিস শরীফ",
    },
  ],
  2: [
    { date: "১৩-১২-২০২৫", week: "শনিবার", subject: "ইংরেজি" },
    { date: "১৪-১২-২০২৫", week: "রবিবার", subject: "গণিত" },
    { date: "১৫-১২-২০২৫", week: "সোমবার", subject: "বাংলা" },
    { date: "১৭-১২-২০২৫", week: "বুধবার", subject: "হাদিস শরীফ" },
    { date: "১৮-১২-২০২৫", week: "বৃহস্পতিবার", subject: "আরবি লিখা" },
    {
      date: "২০-১২-২০২৫",
      week: "শনিবার",
      subject: "কালিমা ও মাসায়িল + বাংলা দিয়ে ইংরেজি শিখি",
    },
  ],
  3: [
    { date: "১৩-১২-২০২৫", week: "শনিবার", subject: "আরবি লিখা" },
    {
      date: "১৪-১২-২০২৫",
      week: "রবিবার",
      subject: "কুরআন মাজিদ ও তাজবীদ + আদ. সালাত ও আদ. মাসনূনাহ",
    },
    {
      date: "১৫-১২-২০২৫",
      week: "সোমবার",
      subject: "কালিমা মাসায়িল ও সাধারণ জ্ঞান + হাদিস শরীফ",
    },
    { date: "১৭-১২-২০২৫", week: "বুধবার", subject: "গণিত" },
    { date: "১৮-১২-২০২৫", week: "বৃহস্পতিবার", subject: "ইংরেজি + ইংরেজি গ্রামার" },
    { date: "২০-১২-২০২৫", week: "শনিবার", subject: "বাংলা" },
  ],
  4: [
    {
      date: "১৩-১২-২০২৫",
      week: "শনিবার",
      subject: "আরবি লিখা + কালিমা মাসায়িল",
    },
    {
      date: "১৪-১২-২০২৫",
      week: "রবিবার",
      subject: "পরিবেশ পরিচিতি ও সাধারণ জ্ঞান + হাদিস ও আস. হুসনা",
    },
    {
      date: "১৫-১২-২০২৫",
      week: "সোমবার",
      subject: "কুরআন মাজিদ ও তাজবীদ + আদ. সালাত ও আদ. মাসনূনাহ",
    },
    { date: "১৭-১২-২০২৫", week: "বুধবার", subject: "বাংলা" },
    { date: "১৮-১২-২০২৫", week: "বৃহস্পতিবার", subject: "ইংরেজি + ইংরেজি গ্রামার" },
    { date: "২০-১২-২০২৫", week: "শনিবার", subject: "গণিত" },
  ],
  5: [
    {
      date: "১৩-১২-২০২৫",
      week: "শনিবার",
      subject: "আরবি লিখা + হাদিস ও আস. হুসনা",
    },
    {
      date: "১৪-১২-২০২৫",
      week: "রবিবার",
      subject: "সমাজ - বিজ্ঞান ও সাধারণ জ্ঞান",
    },
    {
      date: "১৫-১২-২০২৫",
      week: "সোমবার",
      subject: "গণিত",
    },
    {
      date: "১৭-১২-২০২৫",
      week: "বুধবার",
      subject: "ইংরেজি + আদ. সালাত ও আদ. মাসনূনাহ",
    },
    { date: "১৮-১২-২০২৫", week: "বৃহস্পতিবার", subject: "বাংলা" },
    {
      date: "২০-১২-২০২৫",
      week: "শনিবার",
      subject: "কুরআন মাজিদ ও তাজবীদ + কালিমা মাসায়িল",
    },
  ],
  6: [
    {
      date: "০২-১২-২০২৫",
      week: "মঙ্গলবার",
      subject: "গণিত",
    },
    {
      date: "০৩-১২-২০২৫",
      week: "বুধবার",
      subject: "কুরআন মাজিদ",
    },
    {
      date: "০৪-১২-২০২৫",
      week: "বৃহস্পতিবার",
      subject: "ইংরেজি",
    },
    {
      date: "০৬-১২-২০২৫",
      week: "শনিবার",
      subject: "আদ্ দুরূসুলআরাবিয়্যাহ্",
    },
    { date: "০৭-১২-২০২৫", week: "রবিবার", subject: "বিজ্ঞান" },
    {
      date: "০৮-১২-২০২৫",
      week: "সোমবার",
      subject: "বাংলা",
    },
    {
      date: "০৯-১২-২০২৫",
      week: "মঙ্গলবার",
      subject: "সমাজ",
    },
    {
      date: "১০-১২-২০২৫",
      week: "বুধবার",
      subject: "আকইদ ও ফিকাহ",
    },
  ],
  7: [
    {
      date: "০২-১২-২০২৫",
      week: "মঙ্গলবার",
      subject: "গণিত",
    },
    {
      date: "০৩-১২-২০২৫",
      week: "বুধবার",
      subject: "কুরআন মাজিদ",
    },
    {
      date: "০৪-১২-২০২৫",
      week: "বৃহস্পতিবার",
      subject: "ইংরেজি",
    },
    {
      date: "০৬-১২-২০২৫",
      week: "শনিবার",
      subject: "আদ্ দুরূসুলআরাবিয়্যাহ্",
    },
    { date: "০৭-১২-২০২৫", week: "রবিবার", subject: "বিজ্ঞান" },
    {
      date: "০৮-১২-২০২৫",
      week: "সোমবার",
      subject: "বাংলা",
    },
    {
      date: "০৯-১২-২০২৫",
      week: "মঙ্গলবার",
      subject: "সমাজ",
    },
    {
      date: "১০-১২-২০২৫",
      week: "বুধবার",
      subject: "আকইদ ও ফিকাহ",
    },
  ],
};

export const secondTermExamSubjects = {
  100: "হাজিরা নাম্বার",
  101: "বাংলা",
  102: "ইংরেজি",
  103: "গণিত",
  104: "আরবি লিখা",
  105: "হাদিস শরীফ",
  106: "ইংলিশ গ্রামার",
  107: "হিফজুল কুরআন ও তাজবীদ",
  108: "হাদিস শরীফ ও আসমাউল হুসনা",
  109: "কালিমা ও মাসায়িল",
  110: "আদইয়ায়ে সালাত ও আদইয়ায়ে মাসনূনাহ",
  111: "বাংলাদেশ ও বিশ্ব পরিচয়",
  112: "বিজ্ঞান",
  113: "পরিবেশ পরিচিতি ও সাধারণ জ্ঞান",
  114: "পরিবেশ পরিচিতি সমাজ ও পরিবেশ পরিচিতি বিজ্ঞান ও সাধারণ জ্ঞান",
  115: "কুরআন মাজিদ",
  116: "আদ্ দুরূসুল আরাবিয়্যাহ্",
  117: "আকইদ ও ফিকাহ",
  118: "বাংলা দিয়ে ইংরেজি শিখি",
  119: "কালিমা ও মাসায়িল ও সাধারণ জ্ঞান",
};

export const secondTermExamClassBySubjectCodes = {
  1: [100, 104, 105, 109, 101, 102, 103, 118], // play
  2: [100, 104, 105, 109, 101, 102, 103, 118], // nursery
  3: [100, 104, 105, 107, 119, 101, 102, 103, 106, 110], // class 1
  4: [100, 104, 107, 108, 109, 110, 101, 102, 103, 113, 106], // class 2
  5: [100, 104, 107, 108, 109, 110, 101, 102, 103, 114], // class 3
  6: [100, 115, 116, 117, 101, 102, 103, 111, 112], // class 4
  7: [100, 115, 116, 117, 101, 102, 103, 111, 112], // class 5
};

export const subjectInfo = {
  100: { name: "হাজিরা", fullMarks: 25 },
  101: { name: "বাংলা", fullMarks: 100 },
  102: { name: "ইংরেজি", fullMarks: 100 },
  103: { name: "গণিত", fullMarks: 100 },
  104: { name: "আরবি লিখা", fullMarks: 100 },
  105: { name: "হাদিস শরীফ", fullMarks: 100 },
  106: { name: "ইংলিশ গ্রামার", fullMarks: 100 },
  107: { name: "হিফজুল কুরআন ও তাজবীদ", fullMarks: 100 },
  108: { name: "হাদিস শরীফ ও আসমাউল হুসনা", fullMarks: 100 },
  109: { name: "কালিমা ও মাসায়িল", fullMarks: 100 },
  110: { name: "আদইয়ায়ে সালাত ও আদইয়ায়ে মাসনূনাহ", fullMarks: 100 },
  111: { name: "বাংলাদেশ ও বিশ্ব পরিচয়", fullMarks: 100 },
  112: { name: "বিজ্ঞান", fullMarks: 100 },
  113: { name: "পরিবেশ পরিচিতি ও সাধারণ জ্ঞান", fullMarks: 100 },
  114: {
    name: "পরিবেশ পরিচিতি সমাজ ও পরিবেশ পরিচিতি বিজ্ঞান ও সাধারণ জ্ঞান",
    fullMarks: 100,
  },
  115: { name: "কুরআন মাজিদ", fullMarks: 100 },
  116: { name: "আদ্ দুরূসুল আরাবিয়্যাহ্", fullMarks: 100 },
  117: { name: "আকইদ ও ফিকাহ", fullMarks: 100 },
  118: { name: "বাংলা দিয়ে ইংরেজি শিখি", fullMarks: 100 },
  119: { name: "কালিমা ও মাসায়িল ও সাধারণ জ্ঞান", fullMarks: 100 },
};
