export const secondTermExamRoutine = {
  1: [
    { date: "০৩-০৭-২০২৫", week: "বৃহস্পতিবার", subject: "গণিত" },
    { date: "০৫-০৩-২০২৫", week: "শনিবার", subject: "ইংরেজি" },
    { date: "০৭-০৭-২০২৫", week: "সোমবার", subject: "বাংলা" },
    { date: "০৮-০৭-২০২৫", week: "মঙ্গলবার", subject: "আরবি লিখা" },
    { date: "১০-০৭-২০২৫", week: "বৃহস্পতিবার", subject: "হাদিস শরীফ" },
    { date: "১২-০৭-২০২৫", week: "শনিবার", subject: "কালিমা ও মাসায়িল" },
    { date: "১৩-০৭-২০২৫", week: "রবিবার", subject: "বাংলা দিয়ে ইংরেজি শিখি" },
  ],
  2: [
    { date: "০৩-০৭-২০২৫", week: "বৃহস্পতিবার", subject: "ইংরেজি" },
    { date: "০৫-০৩-২০২৫", week: "শনিবার", subject: "গণিত" },
    { date: "০৭-০৭-২০২৫", week: "সোমবার", subject: "আরবি লিখা" },
    { date: "০৮-০৭-২০২৫", week: "মঙ্গলবার", subject: "বাংলা" },
    {
      date: "১০-০৭-২০২৫",
      week: "বৃহস্পতিবার",
      subject: "বাংলা দিয়ে ইংরেজি শিখি",
    },
    { date: "১২-০৭-২০২৫", week: "শনিবার", subject: "হাদিস শরীফ" },
    { date: "১৩-০৭-২০২৫", week: "রবিবার", subject: "কালিমা ও মাসায়িল" },
  ],
  3: [
    { date: "০৩-০৭-২০২৫", week: "বৃহস্পতিবার", subject: "আরবি লিখা" },
    {
      date: "০৫-০৩-২০২৫",
      week: "শনিবার",
      subject: "কুরআন মাজিদ ও তাজবীদ + আদ. সালাত ও আদ. মাসনূনাহ",
    },
    { date: "০৭-০৭-২০২৫", week: "সোমবার", subject: "গণিত" },
    {
      date: "০৮-০৭-২০২৫",
      week: "মঙ্গলবার",
      subject: "কালিমা ও মাসায়িল + সাধারণ জ্ঞান",
    },
    { date: "০৯-০৭-২০২৫", week: "বুধবার", subject: "ইংরেজি গ্রামার" },
    { date: "১০-০৭-২০২৫", week: "বৃহস্পতিবার", subject: "বাংলা" },
    { date: "১২-০৭-২০২৫", week: "শনিবার", subject: "ইংরেজি" },
    { date: "১৩-০৭-২০২৫", week: "রবিবার", subject: "হাদিস শরীফ" },
  ],
  4: [
    { date: "০৩-০৭-২০২৫", week: "বৃহস্পতিবার", subject: "আরবি লিখা" },
    {
      date: "০৫-০৩-২০২৫",
      week: "শনিবার",
      subject: "পরিবেশ পরিচিতি ও সাধারণ জ্ঞান",
    },
    { date: "০৭-০৭-২০২৫", week: "সোমবার", subject: "ইংরেজি গ্রামার" },
    { date: "০৮-০৭-২০২৫", week: "মঙ্গলবার", subject: "গণিত" },
    {
      date: "০৯-০৭-২০২৫",
      week: "বুধবার",
      subject: "কুরআন মাজিদ ও তাজবীদ + হাদিস শরীফ ও আস. হুসনা",
    },
    {
      date: "১০-০৭-২০২৫",
      week: "বৃহস্পতিবার",
      subject: "আদ. সালাত ও আদ. মাসনূনাহ",
    },
    { date: "১২-০৭-২০২৫", week: "শনিবার", subject: "ইংরেজি" },
    { date: "১৩-০৭-২০২৫", week: "রবিবার", subject: "বাংলা" },
  ],
  5: [
    {
      date: "০৩-০৭-২০২৫",
      week: "বৃহস্পতিবার",
      subject: "প.প. সমাজ, প.প. বিজ্ঞান ও সাধারণ জ্ঞান",
    },
    {
      date: "০৫-০৩-২০২৫",
      week: "শনিবার",
      subject: "কালিমা ও মাসায়িল + হাদিস ও আস. হুসনা",
    },
    { date: "০৭-০৭-২০২৫", week: "সোমবার", subject: "গণিত" },
    { date: "০৮-০৭-২০২৫", week: "মঙ্গলবার", subject: "ইংরেজি" },
    { date: "০৯-০৭-২০২৫", week: "বুধবার", subject: "আরবি লিখা" },
    {
      date: "১০-০৭-২০২৫",
      week: "বৃহস্পতিবার",
      subject: "কুরআন মাজিদ ও তাজবীদ",
    },
    { date: "১২-০৭-২০২৫", week: "শনিবার", subject: "বাংলা" },
    { date: "১৩-০৭-২০২৫", week: "রবিবার", subject: "আদ. সালাত ও আদ. মাসনূনাহ" },
  ],
  6: [
    { date: "০৩-০৭-২০২৫", week: "বৃহস্পতিবার", subject: "সমাজ" },
    { date: "০৫-০৩-২০২৫", week: "শনিবার", subject: "বিজ্ঞান" },
    { date: "০৭-০৭-২০২৫", week: "সোমবার", subject: "ইংরেজি" },
    {
      date: "০৮-০৭-২০২৫",
      week: "মঙ্গলবার",
      subject: "আদ্ দুরূসুলআরাবিয়্যাহ্",
    },
    { date: "০৯-০৭-২০২৫", week: "বুধবার", subject: "কুরআন মাজিদ" },
    { date: "১০-০৭-২০২৫", week: "বৃহস্পতিবার", subject: "আকইদ ও ফিকাহ" },
    { date: "১২-০৭-২০২৫", week: "শনিবার", subject: "গণিত" },
    { date: "১৩-০৭-২০২৫", week: "রবিবার", subject: "বাংলা" },
  ],
  7: [
    { date: "০৩-০৭-২০২৫", week: "বৃহস্পতিবার", subject: "সমাজ" },
    { date: "০৫-০৩-২০২৫", week: "শনিবার", subject: "বিজ্ঞান" },
    { date: "০৭-০৭-২০২৫", week: "সোমবার", subject: "ইংরেজি" },
    { date: "০৮-০৭-২০২৫", week: "মঙ্গলবার", subject: "গণিত" },
    { date: "০৯-০৭-২০২৫", week: "বুধবার", subject: "আদ্ দুরূসুলআরাবিয়্যাহ্" },
    { date: "১০-০৭-২০২৫", week: "বৃহস্পতিবার", subject: "আকইদ ও ফিকাহ" },
    { date: "১২-০৭-২০২৫", week: "শনিবার", subject: "বাংলা" },
    { date: "১৩-০৭-২০২৫", week: "রবিবার", subject: "কুরআন মাজিদ" },
  ],
};

export const secondTermExamSubjects = {
  101: "বাংলা",
  102: "ইংরেজি",
  103: "গণিত",
  104: "আরবি লিখা",
  105: "হাদিস শরীফ",
  106: "ইংলিশ গ্রামার",
  107: "হিফজুল কুরআন ও তাজবীদ",
  108: "হাদিস শরীফ ও আসমাউল হুসনা",
  109: "কালিমা ও মাসায়িল",
  110: "আদইয়ায়ে সালাত ও আদইয়ায়ে মাসনূনাহ",
  111: "বাংলাদেশ ও বিশ্ব পরিচয়",
  112: "বিজ্ঞান",
  113: "পরিবেশ পরিচিতি ও সাধারণ জ্ঞান",
  114: "পরিবেশ পরিচিতি সমাজ ও পরিবেশ পরিচিতি বিজ্ঞান ও সাধারণ জ্ঞান",
  115: "কুরআন মাজিদ",
  116: "আদ্ দুরূসুল আরাবিয়্যাহ্",
  117: "আকইদ ও ফিকাহ",
  118: "বাংলা দিয়ে ইংরেজি শিখি",
  119: "কালিমা ও মাসায়িল ও সাধারণ জ্ঞান",
};

export const secondTermExamClassBySubjectCodes = {
  1: [104, 105, 109, 101, 102, 103, 118], // play
  2: [104, 105, 109, 101, 102, 103, 118], // nursery
  3: [104, 105, 107, 119, 101, 102, 103, 106], // class 1
  4: [104, 107, 108, 109, 110, 101, 102, 103, 113, 106], // class 2
  5: [104, 107, 108, 109, 110, 101, 102, 103, 114], // class 3
  6: [115, 116, 117, 101, 102, 103, 111, 112], // class 4
  7: [115, 116, 117, 101, 102, 103, 111, 112], // class 5
};

export const subjectInfo = {
  101: { name: "বাংলা", fullMarks: 100 },
  102: { name: "ইংরেজি", fullMarks: 100 },
  103: { name: "গণিত", fullMarks: 100 },
  104: { name: "আরবি লিখা", fullMarks: 100 },
  105: { name: "হাদিস শরীফ", fullMarks: 100 },
  106: { name: "ইংলিশ গ্রামার", fullMarks: 100 },
  107: { name: "হিফজুল কুরআন ও তাজবীদ", fullMarks: 100 },
  108: { name: "হাদিস শরীফ ও আসমাউল হুসনা", fullMarks: 100 },
  109: { name: "কালিমা ও মাসায়িল", fullMarks: 100 },
  110: { name: "আদইয়ায়ে সালাত ও আদইয়ায়ে মাসনূনাহ", fullMarks: 100 },
  111: { name: "বাংলাদেশ ও বিশ্ব পরিচয়", fullMarks: 100 },
  112: { name: "বিজ্ঞান", fullMarks: 100 },
  113: { name: "পরিবেশ পরিচিতি ও সাধারণ জ্ঞান", fullMarks: 100 },
  114: {
    name: "পরিবেশ পরিচিতি সমাজ ও পরিবেশ পরিচিতি বিজ্ঞান ও সাধারণ জ্ঞান",
    fullMarks: 100,
  },
  115: { name: "কুরআন মাজিদ", fullMarks: 100 },
  116: { name: "আদ্ দুরূসুল আরাবিয়্যাহ্", fullMarks: 100 },
  117: { name: "আকইদ ও ফিকাহ", fullMarks: 100 },
  118: { name: "বাংলা দিয়ে ইংরেজি শিখি", fullMarks: 100 },
  119: { name: "কালিমা ও মাসায়িল ও সাধারণ জ্ঞান", fullMarks: 100 },
};
