export const subjectsCodeWithLabels = {
  // 100: "হাজিরা নাম্বার",
  101: "বাংলা",
  102: "ইংরেজি",
  103: "গণিত",
  104: "আরবি লিখা",
  105: "হাদিস শরীফ",
  106: "ইংলিশ গ্রামার",
  107: "হিফজুল কুরআন ও তাজবীদ",
  108: "হাদিস শরীফ ও আসমাউল হুসনা",
  109: "কালিমা ও মাসায়িল",
  110: "আদইয়ায়ে সালাত ও আদইয়ায়ে মাসনূনাহ",
  111: "বাংলাদেশ ও বিশ্ব পরিচয়",
  112: "বিজ্ঞান",
  113: "পরিবেশ পরিচিতি ও সাধারণ জ্ঞান",
  114: "পরিবেশ পরিচিতি সমাজ ও পরিবেশ পরিচিতি বিজ্ঞান ও সাধারণ জ্ঞান",
  115: "কুরআন মাজিদ",
  116: "আদ্ দুরূসুল আরাবিয়্যাহ্",
  117: "আকইদ ও ফিকাহ",
  118: "বাংলা দিয়ে ইংরেজি শিখি",
  119: "কালিমা ও মাসায়িল ও সাধারণ জ্ঞান",
  120: "তথ্য ও যোগাযোগ প্রযুক্তি",
  121: "ইসলাম ও নৈতিক শিক্ষা",
  122: "কৃষি শিক্ষা",
  123: "বাংলা ১ম পত্র",
  124: "ইংরেজি ১ম পত্র",
  125: "বাংলা ২য় পত্র",
  126: "ইংরেজি ২য় পত্র",
}

export const classBaseSubjectCode = {
  1: [104, 105, 109, 101, 102, 103, 118], // play
  2: [104, 105, 109, 101, 102, 103, 118], // nursery
  3: [104, 105, 107, 119, 101, 102, 103, 118, 110], // class 1
  4: [104, 107, 108, 109, 110, 101, 102, 103, 113, 118], // class 2
  5: [104, 107, 108, 109, 110, 101, 102, 103, 114, 118], // class 3
  6: [115, 116, 117, 101, 102, 103, 111, 112], // class 4
  7: [115, 116, 117, 101, 102, 103, 111, 112], // class 5
  8: [123, 125, 124, 126, 103, 112, 111, 122, 121, 120], // class 6  
};

export const subjectInfo = {
  // 100: "হাজিরা নাম্বার",
  101: {name: "বাংলা", fullMarks: 100},
  102: {name: "ইংরেজি", fullMarks: 100},
  103: {name: "গণিত", fullMarks: 100},
  104: {name: "আরবি লিখা", fullMarks: 100},
  105: {name: "হাদিস শরীফ", fullMarks: 100},
  106: {name: "ইংলিশ গ্রামার", fullMarks: 100},
  107: {name: "হিফজুল কুরআন ও তাজবীদ", fullMarks: 100},
  108: {name: "হাদিস শরীফ ও আসমাউল হুসনা", fullMarks: 100},
  109: {name: "কালিমা ও মাসায়িল", fullMarks: 100},
  110: {name: "আদইয়ায়ে সালাত ও আদইয়ায়ে মাসনূনাহ", fullMarks: 100},
  111: {name: "বাংলাদেশ ও বিশ্ব পরিচয়", fullMarks: 100},
  112: {name: "বিজ্ঞান", fullMarks: 100},
  113: {name: "পরিবেশ পরিচিতি ও সাধারণ জ্ঞান", fullMarks: 100},
  114: {name: "পরিবেশ পরিচিতি সমাজ ও পরিবেশ পরিচিতি বিজ্ঞান ও সাধারণ জ্ঞান", fullMarks: 100},
  115: {name: "কুরআন মাজিদ", fullMarks: 100},
  116: {name: "আদ্ দুরূসুল আরাবিয়্যাহ্", fullMarks: 100},
  117: {name: "আকইদ ও ফিকাহ", fullMarks: 100},
  118: {name: "বাংলা দিয়ে ইংরেজি শিখি", fullMarks: 100},
  119: {name: "কালিমা ও মাসায়িল ও সাধারণ জ্ঞান", fullMarks: 100},
  120: {name: "তথ্য ও যোগাযোগ প্রযুক্তি", fullMarks: 50},
  121: {name: "ইসলাম ও নৈতিক শিক্ষা", fullMarks: 100},
  122: {name: "কৃষি শিক্ষা", fullMarks: 100},
  123: {name: "বাংলা ১ম পত্র", fullMarks: 100},
  124: {name: "ইংরেজি ১ম পত্র", fullMarks: 100},
  125: {name: "বাংলা ২য় পত্র", fullMarks: 50},
  126: {name: "ইংরেজি ২য় পত্র", fullMarks: 50},
}